<?xml version="1.0"?>
<net name="Model33" version="11">
	<layers>
		<layer id="98" name="attention_mask" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="encoder_attention_mask">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="97" name="decoder_input_ids" type="Parameter" version="opset1">
			<data shape="?,?" element_type="i64" />
			<output>
				<port id="0" precision="I64" names="input_ids">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="96" name="Parameter_200664" type="Parameter" version="opset1">
			<data shape="?,?,1024" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="encoder_hidden_states">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="95" name="Parameter_200692" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="Parameter_200691" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="93" name="Parameter_200690" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="Parameter_200689" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.0.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="91" name="Parameter_200696" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="Parameter_200695" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="89" name="Parameter_200694" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="Parameter_200693" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.1.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="Parameter_200700" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="86" name="Parameter_200699" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="Parameter_200698" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="Parameter_200697" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.2.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="83" name="Parameter_200704" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="Parameter_200703" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="81" name="Parameter_200702" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="Parameter_200701" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.3.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="79" name="Parameter_200708" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="Parameter_200707" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="77" name="Parameter_200706" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="Parameter_200705" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.4.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="75" name="Parameter_200712" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="Parameter_200711" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="73" name="Parameter_200710" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="Parameter_200709" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.5.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="Parameter_200716" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="70" name="Parameter_200715" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="Parameter_200714" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="Parameter_200713" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.6.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="67" name="Parameter_200720" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="Parameter_200719" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="65" name="Parameter_200718" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="Parameter_200717" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.7.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="63" name="Parameter_200724" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.8.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="Parameter_200723" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.8.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="61" name="Parameter_200722" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.8.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="Parameter_200721" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.8.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="59" name="Parameter_200728" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.9.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="Parameter_200727" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.9.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="57" name="Parameter_200726" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.9.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="Parameter_200725" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.9.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="Parameter_200732" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.10.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="Parameter_200731" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.10.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="53" name="Parameter_200730" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.10.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="Parameter_200729" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.10.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="51" name="Parameter_200736" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.11.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="Parameter_200735" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.11.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="49" name="Parameter_200734" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.11.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="Parameter_200733" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.11.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="47" name="Parameter_200740" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.12.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="Parameter_200739" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.12.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="45" name="Parameter_200738" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.12.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="Parameter_200737" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.12.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="Parameter_200744" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.13.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="42" name="Parameter_200743" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.13.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="Parameter_200742" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.13.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="Parameter_200741" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.13.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="39" name="Parameter_200748" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.14.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="Parameter_200747" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.14.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="Parameter_200746" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.14.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="36" name="Parameter_200745" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.14.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="Parameter_200752" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.15.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="34" name="Parameter_200751" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.15.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="Parameter_200750" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.15.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="32" name="Parameter_200749" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.15.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="Parameter_200756" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.16.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="30" name="Parameter_200755" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.16.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="Parameter_200754" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.16.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="28" name="Parameter_200753" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.16.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="Parameter_200760" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.17.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="26" name="Parameter_200759" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.17.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="Parameter_200758" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.17.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="Parameter_200757" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.17.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="23" name="Parameter_200764" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.18.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="Parameter_200763" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.18.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="Parameter_200762" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.18.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="20" name="Parameter_200761" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.18.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="Parameter_200768" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.19.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="18" name="Parameter_200767" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.19.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="Parameter_200766" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.19.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="16" name="Parameter_200765" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.19.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="Parameter_200772" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.20.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="14" name="Parameter_200771" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.20.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="Parameter_200770" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.20.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="12" name="Parameter_200769" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.20.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="Parameter_200776" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.21.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="10" name="Parameter_200775" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.21.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="Parameter_200774" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.21.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="Parameter_200773" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.21.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="7" name="Parameter_200780" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.22.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="Parameter_200779" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.22.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="5" name="Parameter_200778" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.22.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="Parameter_200777" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.22.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="Parameter_200784" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.23.decoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="2" name="Parameter_200783" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.23.decoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="Parameter_200782" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.23.encoder.key">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="0" name="Parameter_200781" type="Parameter" version="opset1">
			<data shape="?,16,?,64" element_type="f32" />
			<output>
				<port id="0" precision="FP32" names="past_key_values.23.encoder.value">
					<dim>-1</dim>
					<dim>16</dim>
					<dim>-1</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="99" name="Constant_264722" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="0" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="100" name="Constant_483881" type="Const" version="opset1">
			<data element_type="i8" shape="32128, 1024" offset="4096" size="32899072" />
			<output>
				<port id="0" precision="I8">
					<dim>32128</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="101" name="Convert_483882" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>32128</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>32128</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="102" name="Constant_483883" type="Const" version="opset1">
			<data element_type="f32" shape="32128, 1" offset="32903168" size="128512" />
			<output>
				<port id="0" precision="FP32">
					<dim>32128</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="103" name="__module.model.decoder.embed_tokens/aten::embedding/Gather/fq_weights_0" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>32128</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>32128</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>32128</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="104" name="Constant_265676" type="Const" version="opset1">
			<data element_type="i64" shape="2" offset="33031680" size="16" />
			<output>
				<port id="0" precision="I64">
					<dim>2</dim>
				</port>
			</output>
		</layer>
		<layer id="105" name="__module.model.decoder/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="1" precision="I64">
					<dim>2</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="I64" names="284">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="106" name="__module.model.decoder.embed_tokens/aten::embedding/Convert" type="Convert" version="opset1">
			<data destination_type="i32" />
			<input>
				<port id="0" precision="I64">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
			</output>
		</layer>
		<layer id="107" name="__module.model.decoder.embed_tokens/aten::embedding/Constant" type="Const" version="opset1">
			<data element_type="i32" shape="" offset="33031696" size="4" />
			<output>
				<port id="0" precision="I32" />
			</output>
		</layer>
		<layer id="108" name="__module.model.decoder.embed_tokens/aten::embedding/Gather" type="Gather" version="opset8">
			<data batch_dims="0" />
			<input>
				<port id="0" precision="FP32">
					<dim>32128</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I32">
					<dim>-1</dim>
					<dim>-1</dim>
				</port>
				<port id="2" precision="I32" />
			</input>
			<output>
				<port id="3" precision="FP32" names="285,342,352,hidden_states.3,input.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="109" name="Constant_264434" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="33031700" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="110" name="Constant_264433" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="33035796" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="111" name="Constant_264431" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="33035800" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="112" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::pow/Power" type="Power" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="343">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="113" name="Constant_173774" type="Const" version="opset1">
			<data element_type="i64" shape="1" offset="33035804" size="8" />
			<output>
				<port id="0" precision="I64" names="344">
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="114" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mean/ReduceMean" type="ReduceMean" version="opset1">
			<data keep_dims="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="345,variance.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="115" name="Constant_264432" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1" offset="33035812" size="4" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="116" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::add/Add" type="Add" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="346">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="117" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::rsqrt/Sqrt" type="Sqrt" version="opset1">
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="118" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::rsqrt/Divide" type="Divide" version="opset1">
			<data auto_broadcast="numpy" m_pythondiv="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="347">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="119" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="348,hidden_states.5">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="120" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="349,351,hidden_states.7">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="121" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1_0_0/nncf_smooth_quant/scale" type="Const" version="opset1">
			<data element_type="f32" shape="1, 1, 1024" offset="33035816" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="122" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1_0_0/nncf_smooth_quant" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1</dim>
					<dim>1</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="123" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1_0_0/nncf_smooth_quant/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="33039912" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="124" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1_0_0/nncf_smooth_quant/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="33039916" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="125" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1_0_0/nncf_smooth_quant/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="33039912" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="126" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1_0_0/nncf_smooth_quant/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="33039916" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="127" name="__module.model.decoder.block.0.layer.0.layer_norm/aten::mul/Multiply_1_0_0/nncf_smooth_quant/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="128" name="Constant_483885" type="Const" version="opset1">
			<data element_type="i8" shape="1024, 1024" offset="33039920" size="1048576" />
			<output>
				<port id="0" precision="I8">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="129" name="Convert_483886" type="Convert" version="opset1">
			<data destination_type="f32" />
			<input>
				<port id="0" precision="I8">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="130" name="Constant_483887" type="Const" version="opset1">
			<data element_type="f32" shape="1024, 1" offset="34088496" size="4096" />
			<output>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</output>
		</layer>
		<layer id="131" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul/fq_weights_1" type="Multiply" version="opset1">
			<data auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="132" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul" type="MatMul" version="opset1">
			<data transpose_a="false" transpose_b="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32">
					<dim>1024</dim>
					<dim>1024</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="367,states.1">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="133" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul/fq_output_0/input_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="34092592" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="134" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul/fq_output_0/input_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="34092596" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="135" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul/fq_output_0/output_low" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="34092592" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="136" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul/fq_output_0/output_high" type="Const" version="opset1">
			<data element_type="f32" shape="" offset="34092596" size="4" />
			<output>
				<port id="0" precision="FP32" />
			</output>
		</layer>
		<layer id="137" name="__module.model.decoder.block.0.layer.0.SelfAttention.q/aten::linear/MatMul/fq_output_0" type="FakeQuantize" version="opset1">
			<data levels="256" auto_broadcast="numpy" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="FP32" />
				<port id="2" precision="FP32" />
				<port id="3" precision="FP32" />
				<port id="4" precision="FP32" />
			</input>
			<output>
				<port id="5" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
			</output>
		</layer>
		<layer id="138" name="Constant_265677" type="Const" version="opset1">
			<data element_type="i64" shape="4" offset="34092600" size="32" />
			<output>
				<port id="0" precision="I64">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="139" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::view/Reshape" type="Reshape" version="opset1">
			<data special_zero="true" />
			<input>
				<port id="0" precision="FP32">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>1024</dim>
				</port>
				<port id="1" precision="I64">
					<dim>4</dim>
				</port>
			</input>
			<output>
				<port id="2" precision="FP32" names="369">
					<dim>-1</dim>
					<dim>-1</dim>
					<dim>16</dim>
					<dim>64</dim>
				</port>
			</output>
		</layer>
		<layer id="140" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/ScatterElementsUpdate" type="Const" version="opset1">
			<data element_type="i32" shape="4" offset="34092632" size="16" />
			<output>
				<port id="0" precision="I32">
					<dim>4</dim>
				</port>
			</output>
		</layer>
		<layer id="141" name="__module.model.decoder.block.0.layer.0.SelfAttention/aten::transpose/Transpose" type="Transpose" version="opset1">
